pages/guilda-ia/08-embeddings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Embeddings e Similaridade - Texto como números</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 9 - Guilda de IA: Entendendo embeddings e similaridade por cosseno" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/08-embeddings.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Embeddings e Similaridade - Texto como números">
<meta property="og:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 9 - Guilda de IA: Entendendo embeddings e similaridade por cosseno">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/08-embeddings.html">
<meta name="twitter:title" content="Embeddings e Similaridade - Texto como números">
<meta name="twitter:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 9 - Guilda de IA: Entendendo embeddings e similaridade por cosseno">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">

</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Embeddings e Similaridade - Texto como números</h1>
</div>
<div id="content" class="content">
<div id="outline-container-org7b8cf24" class="outline-2">
<h2 id="org7b8cf24">Semana 9 - Embeddings e Similaridade</h2>
</div>

<div id="outline-container-orgc67a242" class="outline-2">
<h2 id="orgc67a242">O que são Embeddings?</h2>
<div class="outline-text-2" id="text-orgc67a242">
<p>
Imagine que cada palavra ou texto pode ser representado por uma lista de números.
Esses números capturam o <b>significado</b> do texto.
</p>

<blockquote>
<p>
"Embeddings são como coordenadas num mapa de significados."
</p>
</blockquote>
</div>
<div id="outline-container-org288961b" class="outline-3">
<h3 id="org288961b">Como funciona?</h3>
<div class="outline-text-3" id="text-org288961b">
<p>
Palavras com significados parecidos ficam próximas no "espaço vetorial":
</p>

<ul class="org-ul">
<li>"gato" e "cachorro" → vetores próximos</li>
<li>"gato" e "carro" → vetores distantes</li>
</ul>

<p>
Quem decide esses números? Um modelo de ML treinado em bilhões de textos.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb9989ed" class="outline-2">
<h2 id="orgb9989ed">Similaridade por Cosseno</h2>
<div class="outline-text-2" id="text-orgb9989ed">
<p>
<b><b>Conexão com Geometria Analítica!</b></b>
</p>

<p>
Você já estudou ângulos entre vetores? A similaridade por cosseno usa exatamente isso.
</p>

<p>
<b><b>Fórmula:</b></b>
\[\cos(\theta) = \frac{\vec{A} \cdot \vec{B}}{|\vec{A}| \cdot |\vec{B}|}\]
</p>

<p>
<b><b>Interpretação:</b></b>
</p>
<ul class="org-ul">
<li>ângulo = 0° → vetores iguais → cosseno = 1 → <b>muito similares</b></li>
<li>ângulo = 90° → vetores perpendiculares → cosseno = 0 → <b>nada similares</b></li>
<li>ângulo = 180° → vetores opostos → cosseno = -1 → <b>opostos</b></li>
</ul>

<p>
<b><b>Por que funciona?</b></b>
</p>
<ul class="org-ul">
<li>Textos com significado parecido = vetores na mesma direção</li>
<li>Textos com significado diferente = vetores em direções diferentes</li>
</ul>
</div>
</div>
<div id="outline-container-org3a0a273" class="outline-2">
<h2 id="org3a0a273">Por que isso importa?</h2>
<div class="outline-text-2" id="text-org3a0a273">
<p>
Embeddings são a base para:
</p>
<ul class="org-ul">
<li><b><b>Busca semântica:</b></b> encontrar textos parecidos</li>
<li><b><b>RAG:</b></b> buscar documentos relevantes (próxima semana!)</li>
<li><b><b>Tradução:</b></b> entender significados entre idiomas</li>
<li><b><b>Classificação:</b></b> agrupar textos por tema</li>
</ul>
</div>
</div>
<div id="outline-container-org32250f9" class="outline-2">
<h2 id="org32250f9">Prática: calculando similaridade</h2>
<div class="outline-text-2" id="text-org32250f9">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> sentence_transformers <span class="org-keyword">import</span> SentenceTransformer
<span class="org-keyword">from</span> numpy <span class="org-keyword">import</span> dot
<span class="org-keyword">from</span> numpy.linalg <span class="org-keyword">import</span> norm

<span class="org-comment-delimiter"># </span><span class="org-comment">Carregar modelo
</span><span class="org-variable-name">model</span> <span class="org-operator">=</span> SentenceTransformer(<span class="org-string">'all-MiniLM-L6-v2'</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">Converter textos em embeddings
</span><span class="org-variable-name">textos</span> <span class="org-operator">=</span> [<span class="org-string">"Eu amo gatos"</span>, <span class="org-string">"Eu adoro cachorros"</span>, <span class="org-string">"O carro &#233; vermelho"</span>]
<span class="org-variable-name">embeddings</span> <span class="org-operator">=</span> model.encode(textos)

<span class="org-comment-delimiter"># </span><span class="org-comment">Calcular similaridade por cosseno
</span><span class="org-variable-name">cos_sim</span> <span class="org-operator">=</span> <span class="org-keyword">lambda</span> a, b: dot(a, b) <span class="org-operator">/</span> (norm(a) <span class="org-operator">*</span> norm(b))

<span class="org-builtin">print</span>(f<span class="org-string">"gatos vs cachorros: </span>{cos_sim(embeddings[0], embeddings[1]):.3f}<span class="org-string">"</span>)
<span class="org-builtin">print</span>(f<span class="org-string">"gatos vs carro: </span>{cos_sim(embeddings[0], embeddings[2]):.3f}<span class="org-string">"</span>)
</pre>
</div>

<p>
<b><b>Resultado esperado:</b></b>
</p>
<ul class="org-ul">
<li>"gatos vs cachorros" → ~0.7 (parecidos!)</li>
<li>"gatos vs carro" → ~0.1 (diferentes)</li>
</ul>
</div>
</div>
<div id="outline-container-org470476f" class="outline-2">
<h2 id="org470476f">Resumo</h2>
<div class="outline-text-2" id="text-org470476f">
<ol class="org-ol">
<li>Embeddings = texto transformado em números</li>
<li>Similaridade por cosseno = ângulo entre vetores</li>
<li>Textos parecidos = vetores na mesma direção</li>
<li>Conexão direta com geometria analítica</li>
</ol>
</div>
</div>
<div id="outline-container-org55dbc76" class="outline-2">
<h2 id="org55dbc76">Próxima semana</h2>
<div class="outline-text-2" id="text-org55dbc76">
<p>
<b><b>Semana 9 - RAG (Retrieval-Augmented Generation):</b></b> vamos usar embeddings para criar um agente que "lê" documentos!</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/guilda-ia/">&#8592; Voltar para Guilda de IA</a></h3>
</div>
</body>
</html>
